2110010411ci4webgis/app/Controllers/Data.php

SELECT *
FROM `data`
JOIN `master_data` ON `data`.`id_master_data`=`master_data`.`id`
---
    public function index()
    {
        $dataModel = new \App\Models\DataModel();

        $data = $dataModel->select('*')
            ->join('master_data', 'data.id_master_data=master_data.id')
            ->get();

INSERT INTO `master_data` (`nama`) VALUES ('Jumlah Proyeksi Penduduk Menurut Provinsi 2023')
---
    public function import()

    {
        if ($this->request->getPost()) {
            $fileName = $_FILES["csv"]["tmp_name"];

            if ($_FILES['csv']['size'] > 0) {
                $file = fopen($fileName, "r");

                $modelMasterData = new \App\Models\MasterDataModel();
                $dataMaster = [
                    'nama' => $this->request->getPost('nama')
                ];

                $modelMasterData->save($dataMaster);

INSERT INTO `data` (`id_master_data`, `kode_wilayah`, `nilai`)
VALUES (1,'11','5870'), (1,'12','15311'), (1,'13','5758'), (1,'14','7899'), (1,'15','3927'), (1,'16','9000'), (1,'17','2151'), (1,'18','8825'), (1,'19','1658'), (1,'21','2502'), (1,'31','11034'), (1,'32','52786'), (1,'33','35959'), (1,'34','4065'), (1,'35','40646'), (1,'36','14249'), (1,'51','4586'), (1,'52','5376'), (1,'53','5971'), (1,'61','5433'), (1,'62','3031'), (1,'63','4578'), (1,'64','5041'), (1,'65','NULL'), (1,'71','2624'), (1,'72','3300'), (1,'73','9266'), (1,'74','3003'), (1,'75','1300'), (1,'76','1528'), (1,'81','1973'), (1,'82','1391'), (1,'91','1092'), (1,'94','3702')
---
                    array_push($data, $row);
                }

                $builder->insertBatch($data);