2110010411ci4webgis/app/Controllers/Maps.php

SELECT *
FROM `data`
WHERE `id_master_data` = 1
AND `kode_wilayah` = 52
 LIMIT 1
SELECT MAX(nilai) AS nilai
FROM `data`
WHERE `id_master_data` = 1
 LIMIT 1
SELECT *
FROM `master_data`
WHERE `master_data`.`id` = 1
---
    public function index()
    {
        $model = new \App\Models\DataModel();

        $filename = base_url("maps/prov.geojson");
        $file = file_get_contents($filename);
        $file = json_decode($file);

        $features = $file->features;

        foreach ($features as $index => $feature) {
            $kode_wilayah = $feature->properties->kode;
            $data = $model->where('id_master_data', 1)
                ->where('kode_wilayah', $kode_wilayah)
                ->first();

            if ($data) {
                $features[$index]->properties->nilai = $data->nilai;
            }
        }
        $nilaiMax = $model->select('MAX(nilai) AS nilai')->where('id_master_data', 1)->first()->nilai;

        $masterDataModel = new \App\Models\MasterDataModel();
        $masterData = $masterDataModel->find(1);